export default {
  projections: {
    РегистрацКлючаE: {
      комната: {
        __caption__: 'Номер комната'
      },
      карта: {
        __caption__: 'Номер карты'
      },
      считыватель: {
        __caption__: 'Уникальный код'
      },
      сотрудник: {
        __caption__: 'Ответственный'
      }
    },
    РегистрацКлючаL: {
      комната: {
        __caption__: 'Номер комнаты',
        номерКомнаты: {
          __caption__: 'Номер комнаты'
        }
      },
      карта: {
        __caption__: 'Номер карты',
        номерКарты: {
          __caption__: 'Номер карты'
        }
      },
      считыватель: {
        __caption__: 'Уникальный код',
        уникальныйКод: {
          __caption__: 'Уникальный код'
        }
      },
      сотрудник: {
        __caption__: 'Ответственный',
        фИО: {
          __caption__: 'Ответственный'
        }
      }
    }
  },
  validations: {
    карта: {
      __caption__: 'Номер карты'
    },
    комната: {
      __caption__: 'Номер комната'
    },
    сотрудник: {
      __caption__: 'Ответственный'
    },
    считыватель: {
      __caption__: 'Уникальный код'
    }
  }
};
